In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2008_1104/021.htm')

In [3]:
df = df[1]

In [4]:
df.shape

(7, 40)

In [5]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,30,31,32,33,34,35,36,37,38,39
0,"U.S. Representative, District 5 100% of precin...",NaN,NaN,NaN,"Lewis (D) 231,368",Fitzmaurice (Write-In) 25,Kash (Write-In) 81,"Totals 231,474",NaN,NaN,...,0.0,12.0,47020.0,FULTON,217.0,217.0,180551.0,12.0,69.0,180632.0
1,NaN,NaN,NaN,"Lewis (D) 231,368",Fitzmaurice (Write-In) 25,Kash (Write-In) 81,"Totals 231,474",NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,100.0%,0.0%,0.0%,100.0%,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,County,PR,TP,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,CLAYTON,8,8,3809,0,0,3809,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df = df[4:]

In [7]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,30,31,32,33,34,35,36,37,38,39
4,CLAYTON,8,8,3809,0,0,3809,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,DEKALB,43,43,47008,0,12,47020,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,FULTON,217,217,180551,12,69,180632,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df = df[df.columns[[0,3,4,5]]]

In [9]:
df.head(5)

         0       3   4   5
4  CLAYTON    3809   0   0
5   DEKALB   47008   0  12
6   FULTON  180551  12  69

In [10]:
df.columns = ['county', 'John Lewis', 'Jeanne Fitzmaurice', 'Shira Kash']

In [11]:
df.tail(5)

    county John Lewis Jeanne Fitzmaurice Shira Kash
4  CLAYTON       3809                  0          0
5   DEKALB      47008                  0         12
6   FULTON     180551                 12         69

In [12]:
df = df.melt(id_vars=['county'])

In [13]:
df.columns = ['county', 'candidate', 'votes']

In [14]:
df.head()

    county           candidate   votes
0  CLAYTON          John Lewis    3809
1   DEKALB          John Lewis   47008
2   FULTON          John Lewis  180551
3  CLAYTON  Jeanne Fitzmaurice       0
4   DEKALB  Jeanne Fitzmaurice       0

In [15]:
df['votes'] = df['votes'].astype(int)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
county       9 non-null object
candidate    9 non-null object
votes        9 non-null int64
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [17]:
df['office'] = 'U.S. Representative'

In [18]:
df['district'] = '5'

In [19]:
df.loc[df['candidate'] == 'John Lewis', 'party'] = 'Democrat'
df.loc[df['candidate'] == 'Jeanne Fitzmaurice', 'party'] = 'Write-In'
df.loc[df['candidate'] == 'Shira Kash', 'party'] = 'Write-In'

In [20]:
df.groupby(['candidate', 'office', 'district', 'party'])['votes'].sum()

candidate           office               district  party
Jeanne Fitzmaurice  U.S. Representative  5         Write-In        12
John Lewis          U.S. Representative  5         Democrat    231368
Shira Kash          U.S. Representative  5         Write-In        81
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

    county               office district     party           candidate   votes
0  CLAYTON  U.S. Representative        5  Democrat          John Lewis    3809
1   DEKALB  U.S. Representative        5  Democrat          John Lewis   47008
2   FULTON  U.S. Representative        5  Democrat          John Lewis  180551
3  CLAYTON  U.S. Representative        5  Write-In  Jeanne Fitzmaurice       0
4   DEKALB  U.S. Representative        5  Write-In  Jeanne Fitzmaurice       0

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')